PARKHE5570/v2g_dev_fw/02_FW_JC-9V31-60-FT_20260527/Project/STM32F105/stm32f105_init.c

#define _STM32F105_INIT_C


#include "stm32f10x.h"
#include "main.h"
#include "stm32f105_init.h"
#include "INFY_V2G.h"
#include "PLC_3_0.h"
#include "HMI_modbus.h"

void System_Init(void)
{
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO  |
                         RCC_APB2Periph_GPIOA |
                         RCC_APB2Periph_GPIOB |
                         RCC_APB2Periph_GPIOC |
                         RCC_APB2Periph_GPIOD |
                         RCC_APB2Periph_GPIOE, ENABLE);
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 |
                         RCC_APB2Periph_ADC1 |
                         RCC_APB2Periph_USART1, ENABLE);
  
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2 |
                         RCC_APB1Periph_USART3 |
                         RCC_APB1Periph_CAN1   |
                         RCC_APB1Periph_CAN2, ENABLE);
  
  DMA1_Config();
  TIM1_Configuration();
  ADC1_Configuration();
  
  GPIO_Config();
  UART_Init(1,460800);  // UART Monitoring Terminal RS232
  UART_Init(2,38400);   // HMI RS485
//  UART_Init(3,9600);    // Not used
  CAN_Config();
  
  Init_RxMes(&RxMessage1, CAN_ID_EXT); // power module
  Init_TxMes(&TxMessage1, CAN_ID_EXT);
  
  Init_RxMes(&RxMessage2, CAN_ID_EXT); // plc modem
  Init_TxMes(&TxMessage2, CAN_ID_EXT);
  
}

void DMA1_Config()
{
  /*********************** DMA_ADC ***********************/
    DMA_InitTypeDef     DMA_InitStructure;
    NVIC_InitTypeDef    NVIC_InitStructure;

    DMA_DeInit(DMA1_Channel1);                  //DMA1 Channel1 Reset
    DMA_StructInit(&DMA_InitStructure);         //DMA_Struct_Initialize
    
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&ADCConvertedValue;  
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    
    DMA_InitStructure.DMA_BufferSize = 9;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);        //DMA1 Channel1 Set

    ADC_DMACmd(ADC1, ENABLE);                           //Allow ADC1 to transmit a DMA request

    DMA1_Channel1->CNDTR = 9;                           //Same with DMA_BufferSize setting.Just reconfirm.
    DMA1_Channel1->CMAR = (uint32_t)&ADCConvertedValue; //Smae with DMA_MemoryBaseAddr setting. Just reconfirm.

    DMA_Cmd(DMA1_Channel1, ENABLE);                     //DMA1 Channel1 Start

    DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);     //TC(Transfer Complete) -> After transmission is complete, an interrupt occurs
    
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /**********************************************************/
    
    /*********************** USART2_ADC ***********************/
    
    DMA_DeInit(DMA1_Channel7);
    DMA_StructInit(&DMA_InitStructure);
    
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USART2->DR;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)bTxSio_2; 
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    
    DMA_InitStructure.DMA_BufferSize = cTxdMax_2;  
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    
    DMA_Init(DMA1_Channel7, &DMA_InitStructure);
    
    USART_DMACmd(USART2, USART_DMAReq_Tx, ENABLE);

    DMA1_Channel7->CNDTR = cTxdMax_2;
    DMA1_Channel7->CMAR = (uint32_t)bTxSio_2;

    DMA_ITConfig(DMA1_Channel7, DMA_IT_TC, ENABLE);
    
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel7_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /**********************************************************/
}

void TIM1_Configuration(void)
{
    TIM_TimeBaseInitTypeDef     TIM_TimeBaseStructure;
    NVIC_InitTypeDef            NVIC_InitStructure;
      
    TIM_TimeBaseStructure.TIM_Prescaler         = 1;                    // (Prescaler+1=2), [72MHz / {2 * (35999+1)}] = **** 1kHz (1ms) ****
    TIM_TimeBaseStructure.TIM_CounterMode       = TIM_CounterMode_Up;   // Counter direction : 0 to Period
    TIM_TimeBaseStructure.TIM_Period            = 35999;
    TIM_TimeBaseStructure.TIM_ClockDivision     = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;

    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

    NVIC_InitStructure.NVIC_IRQChannel                          = TIM1_UP_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority        = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority               = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd                       = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
}

void ADC1_Configuration()
{
    ADC_InitTypeDef     ADC_InitStructure;

    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 9;
    ADC_Init(ADC1, &ADC_InitStructure);
    
