PARKHE5570/v2g_dev_fw/02_FW_JC-9V31-60-FT_20260527/Project/STM32F105/stm32f105_init.c
    // GPIOA
    ADC_RegularChannelConfig(ADC1, ADC_Channel_0,  1, ADC_SampleTime_28Cycles5);  //[0] PA0     //AD_PLC_CONN
    ADC_RegularChannelConfig(ADC1, ADC_Channel_1,  2, ADC_SampleTime_28Cycles5);  //[1] PA1     //CABLE_AD3
    ADC_RegularChannelConfig(ADC1, ADC_Channel_4,  3, ADC_SampleTime_28Cycles5);  //[2] PA4     //CABLE_AD4
    ADC_RegularChannelConfig(ADC1, ADC_Channel_5,  4, ADC_SampleTime_28Cycles5);  //[3] PA5     //CABLE_AD1
    
    // GPIOC
    ADC_RegularChannelConfig(ADC1, ADC_Channel_10, 5, ADC_SampleTime_28Cycles5);  //[4] PC0     //AD_CP1
    ADC_RegularChannelConfig(ADC1, ADC_Channel_11, 6, ADC_SampleTime_28Cycles5);  //[5] PC1     //AD_PLC_PT1000
    ADC_RegularChannelConfig(ADC1, ADC_Channel_12, 7, ADC_SampleTime_28Cycles5);  //[6] PC2     //AD_DCPT
    ADC_RegularChannelConfig(ADC1, ADC_Channel_13, 8, ADC_SampleTime_28Cycles5);  //[7] PC3     //CABLE_AD5
    ADC_RegularChannelConfig(ADC1, ADC_Channel_14, 9, ADC_SampleTime_28Cycles5);  //[8] PC4     //CABLE_AD2
    
    ADC_Cmd(ADC1, ENABLE);                      //ADC1 ON
  
    ADC_ResetCalibration(ADC1);                 //Calibration Reset
    while(ADC_GetResetCalibrationStatus(ADC1)); //Waiting for initialization to complete

    ADC_StartCalibration(ADC1);                 //Calibration Start
    while(ADC_GetCalibrationStatus(ADC1));      //Waiting for calibration to complete

    ADC_SoftwareStartConvCmd(ADC1, ENABLE); 
}

void IWDG_Configuration()  
{  
	
	/* IWDG_PR and IWDG_RLR  */  
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  
	
	/* IWDG*/  
	IWDG_SetPrescaler(IWDG_Prescaler_32); //IWDG_PR: 40KHz(LSI) / 32 = 1.25 KHz -> 800us  
	
	/* IWDG*/  
	IWDG_SetReload(349); //349 * 800us = 280ms  
	
	/* IWDGIWDG*/  
	IWDG_ReloadCounter();  //Start code and after 100ms refresh
	
	/* IWDG (the LSI oscillator will be enabled by hardware) */  
	IWDG_Enable();  
}

void WWDG_Configuration()
{
	/* WWDG configuration */
	/* Enable WWDG clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG, ENABLE);
	
	/* WWDG clock counter = (36MHz[PCLK1]/4096*8[Prescaler]) = 1098.6 [Hz] = 1/1098.6 [s] = 0.91 [ms]  */
	WWDG_SetPrescaler(WWDG_Prescaler_8);
	
	/* Set Window value to 120; WWDG counter should be refreshed only when the counter
	is below 120 (and greater than 64) otherwise a reset will be generated */
	WWDG_SetWindowValue(120);
	/* Enable WWDG and set counter value to 127, WWDG timeout = 0.91 [ms] * (127-64) = 57.33 ms 
	In this case the refresh window is: 0.91 [ms] * (127-120) = 6.37 [ms] < refresh window < 0.91 [ms] * (127-64) = 57.33 [ms]
	*/
	WWDG_Enable(127);       //Start code
	
	/* Enables the WWDG Early Wakeup interrupt(EWI). */
	WWDG_ClearFlag();
	// WWDG_EnableIT();
}

void Init_RxMes(CanRxMsg *RxMessage, uint8_t CAN_IDE)
{
	u8 i = 0;
	
	RxMessage->StdId = 0x00;
	RxMessage->ExtId = 0x00;
	RxMessage->IDE = CAN_IDE;
	RxMessage->RTR = CAN_RTR_DATA;
	RxMessage->DLC = 8;
	RxMessage->FMI = 0;
	for (i = 0;i < 8;i++)
	{
		RxMessage->Data[i] = 0x00;
	}
}

void Init_TxMes(CanTxMsg *TxMessage, uint8_t CAN_IDE)
{
	u8 i = 0;
	
	TxMessage->StdId=0;
	TxMessage->ExtId=0;
	TxMessage->IDE=CAN_IDE;
	TxMessage->RTR=CAN_RTR_DATA;
	TxMessage->DLC=8;
	for (i = 0;i < 8;i++)
	{
		TxMessage->Data[i] = 0x00;
	}
}

void Init_CAN_buf(uint8_t *CAN_buf)
{
	u8 i = 0;
	for (i = 0;i < 8;i++)
	{
		CAN_buf[i] = 0x00;
	}
}

void GPIO_Config()
{
    GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);  
    
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_4 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);  
    
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_9 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOE, &GPIO_InitStructure); 
    
    /*********************** GPIO_OUTPUT ***********************/
    
                                        //V5.2_name             //Connected     //Acture_use
    
    GPIOA->BRR = GPIO_Pin_8;            //O_MC1                 //CN32          //MC1_Coil
    
    GPIOB->BRR = GPIO_Pin_0;            //O_RY3                 //CN3           //Not_used
    GPIOB->BRR = GPIO_Pin_1;            //O_RY2                 //CN2           //RY2_Coil
    GPIOB->BRR = GPIO_Pin_2;            //O_RY1                 //CN1           //RY1_Coil
    GPIOB->BSRR = GPIO_Pin_6;           //PWM_CP1               //CN23          //Not_used

    GPIOC->BRR = GPIO_Pin_5;            //O_RY4                 //CN4           //Not_used
    GPIOC->BRR = GPIO_Pin_6;            //O_ELCB_TRIP           //CN43          //MCCB1_SOR1
    GPIOC->BRR = GPIO_Pin_7;            //O_FAN                 //CN35          //MC2_Coil
    GPIOC->BRR = GPIO_Pin_8;            //O_MC3                 //CN34          //Not_used
    GPIOC->BRR = GPIO_Pin_9;            //O_MC2                 //CN33          //Not_used
    GPIOC->BRR = GPIO_Pin_11;           //O_STATUS_LED4         //LED34         //Not_used
    GPIOC->BRR = GPIO_Pin_12;           //O_STATUS_LED3         //LED29         //Not_used
    GPIOC->BRR = GPIO_Pin_13;           //U2_EN                 //U2_EN         //U2_EN
    GPIOC->BSRR = GPIO_Pin_14;          //UIRESET1              //CN17, 19      //Not_used
    GPIOC->BSRR = GPIO_Pin_15;          //UIRESET2              //CN18          //Not_used
    
    GPIOD->BRR = GPIO_Pin_0;            //O_STATUS_LED2         //LED30         //Not_used
    GPIOD->BRR = GPIO_Pin_1;            //O_STATUS_LED1         //LED31         //+12Vdc_Input
    GPIOD->BRR = GPIO_Pin_2;            //TP73                  //TP73          //Not_used
    GPIOD->BRR = GPIO_Pin_4;            //O_FAULT               //LED28         //Fault_LED
    GPIOD->BRR = GPIO_Pin_13;           //O_SOL                 //CN40-7        //Not_used        
    GPIOD->BRR = GPIO_Pin_14;           //O_WAKE_RY2            //CN40-2        //Not_used        
    GPIOD->BRR = GPIO_Pin_15;           //O_WAKE_RY1            //CN39-1        //Not_used
    
    GPIOE->BRR = GPIO_Pin_4;            //O_BLED                //CN38-4        //Blue_LED
    GPIOE->BRR = GPIO_Pin_5;            //O_GLED                //CN38-3        //Green_LED        
    GPIOE->BRR = GPIO_Pin_6;            //O_RLED                //CN38-2        //RED_LED        
    GPIOE->BRR = GPIO_Pin_9;            //O_CP_RY1              //CN23          //Not_used
    GPIOE->BRR = GPIO_Pin_11;           //O_DOOR3               //CN46          //Not_used
    GPIOE->BRR = GPIO_Pin_12;           //O_DOOR2               //CN45          //Not_used
    GPIOE->BRR = GPIO_Pin_13;           //O_DOOR1               //CN44          //Not_used
    GPIOE->BRR = GPIO_Pin_14;           //O_RY5                 //CN30          //Not_used
    GPIOE->BRR = GPIO_Pin_15;           //U3_EN                 //CN51, 22, 55, 24        //U3_EN
    
