PARKHE5570/v2g_dev_fw/02_FW_JC-9V31-60-FT_20260527/Project/STM32F105/stm32f105_init.c
    /**********************************************************/
    
    /*********************** GPIO_INPUT ***********************/
    
    // GPIOA: Pin_6, Pin_7
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    //GPIOA_Pin_6       //I_RY2         //CN2           //RY2_Contact
    //GPIOA_Pin_7       //I_RY3         //CN3           //Not_used
    
    // GPIOB: Pin_5, Pin_8, Pin_9, Pin_14, Pin_15
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    //GPIOB_Pin_5       //I_ELCB_TRIP   //CN56          //Not_used
    //GPIOB_Pin_8       //I_MC1         //CN8           //MC1_Contact
    //GPIOB_Pin_9       //LIMIT2        //CN7           //Fuse9_Contact
    //GPIOB_Pin_14      //I_DOOR1       //CN44          //Not_used
    //GPIOB_Pin_15      //I_DOOR2       //CN45          //Not_used
    
    // GPIOC: Pin_10
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
    //GPIOC_Pin_10      //I_RY4         //CN4           //Not_used
    
    // GPIOD: Pin_3, Pin_5, Pin_6, Pin_7, Pin_8, Pin_9, Pin_10, Pin_11, Pin_12
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
    //GPIOD_Pin_3       //I_RY1         //CN1           //RY1_Contact
    //GPIOD_Pin_5       //I_ELCB        //CN25          //MCCB1_Contact
    //GPIOD_Pin_6       //I_LIMIT       //CN26          //DOOR_Contact
    //GPIOD_Pin_7       //I_MC3         //CN27          //SPD1_Contact
    //GPIOD_Pin_8       //I_DOOR3       //CN46          //Not_used
    //GPIOD_Pin_9       //I_EMG         //+12V EMG      //+12V_EMG
    //GPIOD_Pin_10      //WDD_B_R       //CN21-7        //Not_used
    //GPIOD_Pin_11      //I_WELDING     //CN21-1        //Not_used        
    //GPIOD_Pin_12      //I_RCD_TRIP    //CN20          //Not_used
    
    // GPIOE: Pin_0, Pin_1, Pin_2, Pin_3, Pin_7, Pin_8, Pin_10
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOE, &GPIO_InitStructure);
    //GPIOE_Pin_0       //I_DCGF        //CN41          //Fuse8_Contact
    //GPIOE_Pin_1       //LIMIT1        //CN5           //COUPLER_SW1_Contact
    //GPIOE_Pin_2       //+3.3V or GND  //CN6           //Not_used
    //GPIOE_Pin_3       //LIMIT3        //CN10          //MC2_Contact
    //GPIOE_Pin_7       //I_Sol         //CN40-7        //Not_used
    //GPIOE_Pin_8       //I_PILOT       //CN40-3        //Not_used
    //GPIOE_Pin_10      //I_CABLE24V    //CN62          //Not_used
    
    /**********************************************************/

    /*************************** AD ***************************/
    
    // GPIOA: PA0, PA1, PA4, PA5 -> AIN 모드 설정
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    //GPIOA_Pin_0,      //AD_PLC_CONN           //CN63-1        //CCS_CABLE1_CS
    //GPIOA_Pin_1,      //CABLE_AD3             //CN66          //Not_used
    //GPIOA_Pin_4,      //CABLE_AD4             //CN67          //Not_used
    //GPIOA_Pin_5,      //CABLE_AD1             //CN64          //Not_used
    
    // GPIOC: PC0, PC1, PC2, PC3, PC4 -> AIN 모드 설정
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
    //GPIOC_Pin_0,      //AD_CP1                //CN23          //Not_used
    //GPIOC_Pin_1,      //AD_PLC_PT1000         //CN63-2        //CCS_CABLE1_PT1000
    //GPIOC_Pin_2,      //AD_DCPT               //CN57-2        //Not_used
    //GPIOC_Pin_3,      //CABLE_AD5             //CN68          //Not_used
    //GPIOC_Pin_4,      //CABLE_AD2             //CN65          //Not_used
    
    /**********************************************************/
    
}


void UART_Init(u8 uart,u32 baud)
{
  /*
  * USARTx configured as follow:
  * - BaudRate = baud
  * - Word Length = 8 Bits
  * - One Stop Bit
  * - No parity
  * - Hardware flow control disabled
  * - Receive and transmit enabled
  *
  * [Pin Mapping]
  * UART1 : PA9(Tx),  PA10(Rx) - RS232 Monitoring Terminal
  * UART2 : PA2(Tx),  PA3(Rx)  - HMI RS485
  * UART3 : PB10(Tx), PB11(Rx) - Not_used
  *
  * Note: USART1/2/3 clock is already enabled in System_Init().
  */
	
	USART_InitTypeDef USART_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;  
	
	if(uart == 1)
	{
		/* Enable USART1 clock */
		//Declaration completed within the “System_init()” function.
                
		/* Configure USART1 Tx (PA.9) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
                
		/* Configure USART1 Rx (PA.10) as input floating */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;   //ST3232B-R1OUT Connected, always active output
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		
                USART_InitStructure.USART_BaudRate            = baud;
                USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
                USART_InitStructure.USART_StopBits            = USART_StopBits_1;
                USART_InitStructure.USART_Parity              = USART_Parity_No;
                USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
                USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
                
                /* Configure UART1 */
                USART_Init(USART1, &USART_InitStructure);
                
                /* Enable the UART1 */
                USART_Cmd(USART1, ENABLE);
                
