PARKHE5570/v2g_dev_fw/02_FW_JC-9V31-60-FT_20260527/Project/STM32F105/stm32f105_init.c
                /* Enable USART1 Receive interrupt */
		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
                
                /* Enable the USART1 Interrupt */
                NVIC_InitStructure.NVIC_IRQChannel                   = USART1_IRQn;
                NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
                NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
                NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
                NVIC_Init(&NVIC_InitStructure);
                
	}
	
	else if(uart == 2)
	{
		/* Enable USART2 clock */
                //Declaration completed within the “System_init()” function.
                
		/* Configure USART2 Tx (PA.2) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
                
		/* Configure USART2 Rx (PA.3) as input pull-up */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;           //During transmission, the MAX3430ESA-RO enters a high-impedance state.
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		
		USART_InitStructure.USART_BaudRate            = baud;
                USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
                USART_InitStructure.USART_StopBits            = USART_StopBits_1;
                USART_InitStructure.USART_Parity              = USART_Parity_No;
                USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
                USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
                
                /* Configure UART2 */
                USART_Init(USART2, &USART_InitStructure);
                
                /* Enable the UART2 */
                USART_Cmd(USART2, ENABLE);
                
                /* Enable USART2 Receive interrupt */
		USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
                
                /* Enable the USART2 Interrupt */
                NVIC_InitStructure.NVIC_IRQChannel                   = USART2_IRQn;
                NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
                NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
                NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
                NVIC_Init(&NVIC_InitStructure);
                
	}
	else if(uart == 3)
	{
		/* Enable USART3 clock */
		//Declaration completed within the “System_init()” function.
                
		/* Configure USART3 Tx (PB.10) as alternate function push-pull */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
                
		/* Configure USART3 Rx (PB.11) as input pull-up */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;           //During transmission, the MAX3430ESA-RO enters a high-impedance state.
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		
		USART_InitStructure.USART_BaudRate = baud;
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;
		USART_InitStructure.USART_StopBits = USART_StopBits_1;
		USART_InitStructure.USART_Parity = USART_Parity_No;
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
                
                /* Configure UART3 */
                USART_Init(USART3, &USART_InitStructure);
                
                /* Enable the UART3 */
                USART_Cmd(USART3, ENABLE);
                
                /* Enable USART3 Receive interrupt */
		USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
                
                /* Enable the USART3 Interrupt */
                NVIC_InitStructure.NVIC_IRQChannel                   = USART3_IRQn;
                NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
                NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
                NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
                NVIC_Init(&NVIC_InitStructure);
	}
}


void CAN_Config(void)
{
  
/*----------------------------------CAN GPIO----------------------------------*/
  
	CAN_InitTypeDef        CAN_InitStructure;
	CAN_FilterInitTypeDef  CAN_FilterInitStructure;
	
	GPIO_InitTypeDef  GPIO_InitStructure;
	
	/* GPIO clock enable */
	
	/* __CAN1_USED__ */
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	/* __CAN2_USED__ */
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
/*----------------------------------CAN1----------------------------------*/
        
	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE; //time-triggered communication mode = DISABLED
	CAN_InitStructure.CAN_ABOM = ENABLE;// DISABLE; // automatic bus-off management mode = DISABLED
	CAN_InitStructure.CAN_AWUM = DISABLE;//DISABLE; // automatic wake-up mode = DISABLED
	CAN_InitStructure.CAN_NART = DISABLE; // non-automatic retransmission mode = DISABLED
	CAN_InitStructure.CAN_RFLM = DISABLE; // receive FIFO locked mode = DISABLED
	CAN_InitStructure.CAN_TXFP = DISABLE; // transmit FIFO priority = DISABLED
	CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;//CAN_Mode_LoopBack;//CAN_Mode_Normal;
	
        //Sample-point : 87.5%
        //[36Mhz/{(1+13+2)*18}] = 125,000
	CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;        // synchronization jump width = 1
	CAN_InitStructure.CAN_BS1 = CAN_BS1_13tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_2tq;
	CAN_InitStructure.CAN_Prescaler = 18;
	CAN_Init(CAN1, &CAN_InitStructure);             //125 [kbit/s]
	
        
	/* CAN filter init for INFY*/ 
	CAN_FilterInitStructure.CAN_FilterNumber        = 0;
	CAN_FilterInitStructure.CAN_FilterMode          = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale         = CAN_FilterScale_32bit; // One 32-bit filter for the STDID[10:0], EXTID[17:0], IDE and RTR bits
                                                                                        //0x04 : IDE (1 = Extended ID)        
	CAN_FilterInitStructure.CAN_FilterIdHigh        = (uint16_t)(((0x02A3F000 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterIdLow         = (uint16_t)(((0x02A3F000 << 3) | 0x04) & 0xFFFF);
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh    = (uint16_t)(((0x1F0FFF00 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterMaskIdLow     = (uint16_t)(((0x1F0FFF00 << 3) | 0x04) & 0xFFFF);
        
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment=0;
	CAN_FilterInitStructure.CAN_FilterActivation    = ENABLE; 
	CAN_FilterInit(&CAN_FilterInitStructure);
	CAN_ITConfig(CAN1,CAN_IT_FMP0, ENABLE); 
	
/*----------------------------------CAN2----------------------------------*/
        
	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE; //time-triggered communication mode = DISABLED
	CAN_InitStructure.CAN_ABOM = ENABLE;// DISABLE; // automatic bus-off management mode = DISABLED
	CAN_InitStructure.CAN_AWUM = DISABLE;//DISABLE; // automatic wake-up mode = DISABLED
	CAN_InitStructure.CAN_NART = DISABLE; // non-automatic retransmission mode = DISABLED
	CAN_InitStructure.CAN_RFLM = DISABLE; // receive FIFO locked mode = DISABLED
	CAN_InitStructure.CAN_TXFP = DISABLE; // transmit FIFO priority = DISABLED
	CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;//CAN_Mode_LoopBack;//CAN_Mode_Normal;
	
