PARKHE5570/v2g_dev_fw/02_FW_JC-9V31-60-FT_20260527/Project/STM32F105/stm32f105_init.c
        //Sample-point : 88.9%
        //[36Mhz/{(1+15+2)*4}] = 500,000
	CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;        // synchronization jump width = 1
	CAN_InitStructure.CAN_BS1 = CAN_BS1_15tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_2tq;
	CAN_InitStructure.CAN_Prescaler = 4;            //500 [kbit/s]
	CAN_Init(CAN2, &CAN_InitStructure);
	
	
	//plc 3.0
	CAN_FilterInitStructure.CAN_FilterNumber        = 14;
	CAN_FilterInitStructure.CAN_FilterMode          = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale         = CAN_FilterScale_32bit; // One 32-bit filter for the STDID[10:0], EXTID[17:0], IDE and RTR bits
                                                                                        //0x04 : IDE (1 = Extended ID)
	CAN_FilterInitStructure.CAN_FilterIdHigh        = (uint16_t)(((0x15EC0000 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterIdLow         = (uint16_t)(((0x15EC0000 << 3) | 0x04) & 0xFFFF);
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh    = (uint16_t)(((0x1FFF0000 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterMaskIdLow     = (uint16_t)(((0x1FFF0000 << 3) | 0x04) & 0xFFFF);
        
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment= 0;
	CAN_FilterInitStructure.CAN_FilterActivation    = ENABLE;//DISABLE;//ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);
	CAN_ITConfig(CAN2,CAN_IT_FMP0, ENABLE);
        
        //Sendyne IMD : SIM200
        CAN_FilterInitStructure.CAN_FilterNumber        = 15;
	CAN_FilterInitStructure.CAN_FilterMode          = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale         = CAN_FilterScale_32bit; // One 32-bit filter for the STDID[10:0], EXTID[17:0], IDE and RTR bits
                                                                                        //0x04 : IDE (1 = Extended ID)
	CAN_FilterInitStructure.CAN_FilterIdHigh        = (uint16_t)(((0x0A100100 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterIdLow         = (uint16_t)(((0x0A100100 << 3) | 0x04) & 0xFFFF);
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh    = (uint16_t)(((0x1FFFFF00 << 3) | 0x04) >> 16);
	CAN_FilterInitStructure.CAN_FilterMaskIdLow     = (uint16_t)(((0x1FFFFF00 << 3) | 0x04) & 0xFFFF);
        
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment= 0;
	CAN_FilterInitStructure.CAN_FilterActivation    = ENABLE;//DISABLE;//ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);
        CAN_ITConfig(CAN2,CAN_IT_FMP0, ENABLE);
        

	
	NVIC_InitTypeDef NVIC_InitStructure;
	
	NVIC_InitStructure.NVIC_IRQChannel = CAN1_RX0_IRQn;//CAN_RX1_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);       
	
	NVIC_InitStructure.NVIC_IRQChannel = CAN2_RX0_IRQn;//CAN_RX2_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
}


